"""咖啡流程共享配置：点位、IP 等"""

ROBOT_IP = "192.168.31.6"
ROBOT_PORT = 8899
GRIPPER_IP = "192.168.31.10"
GRIPPER_URL = f"http://{GRIPPER_IP}"

# 六轴关节角 (rad)
POS_HOME        = [-3.0075, -0.0247, 2.1940, 2.0989, 1.2444, -0.0142]  # 初始位姿
POS_GRAB        = [-2.9943, -1.0912, 1.2830, 2.3219, 1.4476, -0.0142]  # 抓杯子点位
POS_MID         = [-2.9077, -0.7870, 1.6746, 2.3219, 1.4476, -0.0142]  # 中间姿态
POS_COFFEE      = [-2.7957, -1.1157, 1.2347, 2.3217, 1.2838, -0.0142]  # 咖啡机位置
POS_AFTER_COFFEE = [-2.8109, -1.1516, 1.1113, 2.1251, 1.2838, -0.0142]  # 放杯后移出
#POS_LID_MID     = [-2.7271, -0.5983, 1.7766, 2.3482, 1.3046, -0.0142]  # 开盖中间
POS_LID_OPEN    = [-2.7957, -0.9232, 1.2580,2.0739, 1.2496, -0.0142]  # 开盖位置
POS_PUSH_MID    = [-2.7912, -0.9026, 1.2406, 2.0988, 1.2445,-0.0142]  # 推盖中间
POS_PUSH        = [-2.8215, -1.1117,0.8284,2.0079,1.2495, -0.0142]  # 推盖位置

# 完整流程步骤定义 (描述, 动作类型, 参数)
# 动作类型: "movej" = 移动关节, "gripper" = 夹爪控制
STEPS = [
    ("张开夹爪",          "gripper",  {"percent": 100}),
    ("移动到抓杯点位",    "movej",    POS_GRAB),
    ("夹爪闭合5%抓杯",    "gripper",  {"percent": 5}),
    ("移动到中间姿态",    "movej",    POS_MID),
    ("移动到咖啡机",      "movej",    POS_COFFEE),
    ("松开夹爪放杯",      "gripper",  {"percent": 100}),
    ("移出咖啡机",        "movej",    POS_AFTER_COFFEE),
    #("移到开盖中间",      "movej",    POS_LID_MID),
    ("开盖+夹爪16%",      "movej+gripper", (POS_LID_OPEN, {"percent": 16})),
    ("推盖中间+夹爪0%",   "movej+gripper", (POS_PUSH_MID, {"percent": 0})),
    ("推盖子",            "movej",    POS_PUSH),
]
